/*2553725 林于蕙 卓11*/

#include<iostream>
#include<conio.h>
#include"cmd_console_tools.h"
using namespace std;
/* ----------------------------------------------------------------------------------

	 本文件功能：
	1、放被调用的菜单函数，要求显示各菜单项，读入正确的选项后返回

	 本文件要求：
	1、不允许定义外部全局变量（const及#define不在限制范围内）
	2、不允许定义静态全局变量（全局变量的使用准则是：少用、慎用、能不用尽量不用）
	3、静态局部变量的数量不限制，但使用准则也是：少用、慎用、能不用尽量不用
	4、按需加入系统头文件、自定义头文件、命名空间等

   ----------------------------------------------------------------------------------- */


   /***************************************************************************
	 函数名称：
	 功    能：
	 输入参数：
	 返 回 值：
	 说    明：
   ***************************************************************************/
int mine_sweeper_menu()
{
	int choose;
	cct_cls();
	cout << "--------------------------------------------" << endl;
	cout << "1.选择模式，显示内部数组" << endl;
	cout << "2.输入一个位置，显示打开区域" << endl;
	cout << "3.内部数组基础版" << endl;
	cout << "4.内部数组完整版（标记、运行时间）" << endl;
	cout << "5.画出框架，显示内部数据" << endl;
	cout << "6.检测鼠标位置和合法性，以及左键点击" << endl;
	cout << "7.鼠标点击一次，显示打开区域" << endl;
	cout << "8.允许连续游戏，支持右键标记，判断游戏结束" << endl;
	cout << "9.完整游戏，标明雷数，空格、结束显示时间" << endl;
	cout << "0.退出游戏" << endl;
	cout << "--------------------------------------------" << endl;
	cout << "[请选择] ";
	while (1) {
		choose = _getch();
		if (choose >= '0' && choose <= '9') {
			putchar(choose);
			cout << endl;
			break;
		}
	}
	return choose - '0';             //将choose由数字的ASCII码转化为数字
}
int mine_sweeper_submenu()
{
	int sub_choose;
	cct_cls();
	cout << "请输入扫雷游戏的等级（数字），初级\\中级\\高级（1\\2\\3）";
	while (1) {
		sub_choose = _getch();
		if (sub_choose >= '0' && sub_choose <= '3') {
			putchar(sub_choose);
			cout << endl;
			break;
		}
	}
	cct_cls();
	return sub_choose - '0';             //将choose由数字的ASCII码转化为数字
}